Revit 2027 API
Connector.CoordinateSystem Property
The coordinate system of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Transform CoordinateSystem { get; }
Public Overridable ReadOnly Property CoordinateSystem As Transform
	Get
public:
virtual property Transform^ CoordinateSystem {
	Transform^ get ();
}
abstract CoordinateSystem : Transform with get
override CoordinateSystem : Transform with get
Property Value
Transform
Implements
IConnector.CoordinateSystem
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector is of logical type.
InvalidOperationException |  Thrown on failure to get coordinate system.
Remarks
The coordinate system's origin is the location of the connector and the Z-axis is normal to the connector.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace